espressif/esp-idf/components/soc/esp32p4/include/soc/pcr_reg.h
/** PCR_SYSCLK_FREQ_QUERY_0_REG register
 *  SYSCLK frequency query 0 register
 */
#define PCR_SYSCLK_FREQ_QUERY_0_REG (DR_REG_PCR_BASE + 0x124)
/** PCR_FOSC_FREQ : HRO; bitpos: [7:0]; default: 20;
 *  This field indicates the frequency(MHz) of FOSC.
 */
#define PCR_FOSC_FREQ    0x000000FFU
#define PCR_FOSC_FREQ_M  (PCR_FOSC_FREQ_V << PCR_FOSC_FREQ_S)
#define PCR_FOSC_FREQ_V  0x000000FFU
#define PCR_FOSC_FREQ_S  0
/** PCR_PLL_FREQ : HRO; bitpos: [17:8]; default: 480;
 *  This field indicates the frequency(MHz) of SPLL.
 */
#define PCR_PLL_FREQ    0x000003FFU
#define PCR_PLL_FREQ_M  (PCR_PLL_FREQ_V << PCR_PLL_FREQ_S)
#define PCR_PLL_FREQ_V  0x000003FFU
#define PCR_PLL_FREQ_S  8

/** PCR_PLL_DIV_CLK_EN_REG register
 *  SPLL DIV clock-gating configuration register
 */
#define PCR_PLL_DIV_CLK_EN_REG (DR_REG_PCR_BASE + 0x128)
/** PCR_PLL_240M_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  This field is used to open 240 MHz clock (div2 of SPLL) drived from SPLL. 0: close,
 *  1: open(default). Only avaliable when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_240M_CLK_EN    (BIT(0))
#define PCR_PLL_240M_CLK_EN_M  (PCR_PLL_240M_CLK_EN_V << PCR_PLL_240M_CLK_EN_S)
#define PCR_PLL_240M_CLK_EN_V  0x00000001U
#define PCR_PLL_240M_CLK_EN_S  0
/** PCR_PLL_160M_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  This field is used to open 160 MHz clock (div3 of SPLL) drived from SPLL. 0: close,
 *  1: open(default). Only avaliable when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_160M_CLK_EN    (BIT(1))
#define PCR_PLL_160M_CLK_EN_M  (PCR_PLL_160M_CLK_EN_V << PCR_PLL_160M_CLK_EN_S)
#define PCR_PLL_160M_CLK_EN_V  0x00000001U
#define PCR_PLL_160M_CLK_EN_S  1
/** PCR_PLL_120M_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  This field is used to open 120 MHz clock (div4 of SPLL) drived from SPLL. 0: close,
 *  1: open(default). Only avaliable when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_120M_CLK_EN    (BIT(2))
#define PCR_PLL_120M_CLK_EN_M  (PCR_PLL_120M_CLK_EN_V << PCR_PLL_120M_CLK_EN_S)
#define PCR_PLL_120M_CLK_EN_V  0x00000001U
#define PCR_PLL_120M_CLK_EN_S  2
/** PCR_PLL_80M_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  This field is used to open 80 MHz clock (div6  of SPLL) drived from SPLL. 0: close,
 *  1: open(default). Only avaliable when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_80M_CLK_EN    (BIT(3))
#define PCR_PLL_80M_CLK_EN_M  (PCR_PLL_80M_CLK_EN_V << PCR_PLL_80M_CLK_EN_S)
#define PCR_PLL_80M_CLK_EN_V  0x00000001U
#define PCR_PLL_80M_CLK_EN_S  3
/** PCR_PLL_48M_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  This field is used to open 48 MHz clock (div10 of SPLL) drived from SPLL. 0: close,
 *  1: open(default). Only avaliable when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_48M_CLK_EN    (BIT(4))
#define PCR_PLL_48M_CLK_EN_M  (PCR_PLL_48M_CLK_EN_V << PCR_PLL_48M_CLK_EN_S)
#define PCR_PLL_48M_CLK_EN_V  0x00000001U
#define PCR_PLL_48M_CLK_EN_S  4
/** PCR_PLL_40M_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  This field is used to open 40 MHz clock (div12 of SPLL) drived from SPLL. 0: close,
 *  1: open(default). Only avaliable when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_40M_CLK_EN    (BIT(5))
#define PCR_PLL_40M_CLK_EN_M  (PCR_PLL_40M_CLK_EN_V << PCR_PLL_40M_CLK_EN_S)
#define PCR_PLL_40M_CLK_EN_V  0x00000001U
#define PCR_PLL_40M_CLK_EN_S  5
/** PCR_PLL_20M_CLK_EN : R/W; bitpos: [6]; default: 1;
 *  This field is used to open 20 MHz clock (div24 of SPLL) drived from SPLL. 0: close,
 *  1: open(default). Only avaliable when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_20M_CLK_EN    (BIT(6))
#define PCR_PLL_20M_CLK_EN_M  (PCR_PLL_20M_CLK_EN_V << PCR_PLL_20M_CLK_EN_S)
#define PCR_PLL_20M_CLK_EN_V  0x00000001U
#define PCR_PLL_20M_CLK_EN_S  6

/** PCR_CTRL_CLK_OUT_EN_REG register
 *  CLK_OUT_EN configuration register
 */
#define PCR_CTRL_CLK_OUT_EN_REG (DR_REG_PCR_BASE + 0x12c)
/** PCR_CLK20_OEN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable 20m clock
 */
#define PCR_CLK20_OEN    (BIT(0))
#define PCR_CLK20_OEN_M  (PCR_CLK20_OEN_V << PCR_CLK20_OEN_S)
#define PCR_CLK20_OEN_V  0x00000001U
#define PCR_CLK20_OEN_S  0
/** PCR_CLK22_OEN : R/W; bitpos: [1]; default: 1;
 *  Set 1 to enable 22m clock
 */
#define PCR_CLK22_OEN    (BIT(1))
#define PCR_CLK22_OEN_M  (PCR_CLK22_OEN_V << PCR_CLK22_OEN_S)
#define PCR_CLK22_OEN_V  0x00000001U
#define PCR_CLK22_OEN_S  1
/** PCR_CLK44_OEN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable 44m clock
 */
#define PCR_CLK44_OEN    (BIT(2))
#define PCR_CLK44_OEN_M  (PCR_CLK44_OEN_V << PCR_CLK44_OEN_S)
#define PCR_CLK44_OEN_V  0x00000001U
#define PCR_CLK44_OEN_S  2
/** PCR_CLK_BB_OEN : R/W; bitpos: [3]; default: 1;
 *  Set 1 to enable bb clock
 */
#define PCR_CLK_BB_OEN    (BIT(3))
#define PCR_CLK_BB_OEN_M  (PCR_CLK_BB_OEN_V << PCR_CLK_BB_OEN_S)
#define PCR_CLK_BB_OEN_V  0x00000001U
#define PCR_CLK_BB_OEN_S  3
/** PCR_CLK80_OEN : R/W; bitpos: [4]; default: 1;
 *  Set 1 to enable 80m clock
 */
#define PCR_CLK80_OEN    (BIT(4))
#define PCR_CLK80_OEN_M  (PCR_CLK80_OEN_V << PCR_CLK80_OEN_S)
#define PCR_CLK80_OEN_V  0x00000001U
#define PCR_CLK80_OEN_S  4
/** PCR_CLK160_OEN : R/W; bitpos: [5]; default: 1;
 *  Set 1 to enable 160m clock
 */
#define PCR_CLK160_OEN    (BIT(5))
#define PCR_CLK160_OEN_M  (PCR_CLK160_OEN_V << PCR_CLK160_OEN_S)
#define PCR_CLK160_OEN_V  0x00000001U
#define PCR_CLK160_OEN_S  5
/** PCR_CLK_320M_OEN : R/W; bitpos: [6]; default: 1;
 *  Set 1 to enable 320m clock
 */
#define PCR_CLK_320M_OEN    (BIT(6))
#define PCR_CLK_320M_OEN_M  (PCR_CLK_320M_OEN_V << PCR_CLK_320M_OEN_S)
#define PCR_CLK_320M_OEN_V  0x00000001U
#define PCR_CLK_320M_OEN_S  6
/** PCR_CLK_ADC_INF_OEN : R/W; bitpos: [7]; default: 1;
 *  Reserved
 */
#define PCR_CLK_ADC_INF_OEN    (BIT(7))
#define PCR_CLK_ADC_INF_OEN_M  (PCR_CLK_ADC_INF_OEN_V << PCR_CLK_ADC_INF_OEN_S)
#define PCR_CLK_ADC_INF_OEN_V  0x00000001U
#define PCR_CLK_ADC_INF_OEN_S  7
/** PCR_CLK_DAC_CPU_OEN : R/W; bitpos: [8]; default: 1;
 *  Reserved
 */
#define PCR_CLK_DAC_CPU_OEN    (BIT(8))
#define PCR_CLK_DAC_CPU_OEN_M  (PCR_CLK_DAC_CPU_OEN_V << PCR_CLK_DAC_CPU_OEN_S)
#define PCR_CLK_DAC_CPU_OEN_V  0x00000001U
#define PCR_CLK_DAC_CPU_OEN_S  8
/** PCR_CLK40X_BB_OEN : R/W; bitpos: [9]; default: 1;
 *  Set 1 to enable 40x_bb clock
 */
#define PCR_CLK40X_BB_OEN    (BIT(9))
#define PCR_CLK40X_BB_OEN_M  (PCR_CLK40X_BB_OEN_V << PCR_CLK40X_BB_OEN_S)
#define PCR_CLK40X_BB_OEN_V  0x00000001U
#define PCR_CLK40X_BB_OEN_S  9
/** PCR_CLK_XTAL_OEN : R/W; bitpos: [10]; default: 1;
 *  Set 1 to enable xtal clock
 */
#define PCR_CLK_XTAL_OEN    (BIT(10))
#define PCR_CLK_XTAL_OEN_M  (PCR_CLK_XTAL_OEN_V << PCR_CLK_XTAL_OEN_S)
#define PCR_CLK_XTAL_OEN_V  0x00000001U
#define PCR_CLK_XTAL_OEN_S  10

/** PCR_CTRL_TICK_CONF_REG register
 *  TICK configuration register
 */
#define PCR_CTRL_TICK_CONF_REG (DR_REG_PCR_BASE + 0x130)
/** PCR_XTAL_TICK_NUM : R/W; bitpos: [7:0]; default: 39;
 *  ******* Description ***********
 */
#define PCR_XTAL_TICK_NUM    0x000000FFU
#define PCR_XTAL_TICK_NUM_M  (PCR_XTAL_TICK_NUM_V << PCR_XTAL_TICK_NUM_S)
#define PCR_XTAL_TICK_NUM_V  0x000000FFU
#define PCR_XTAL_TICK_NUM_S  0
/** PCR_FOSC_TICK_NUM : R/W; bitpos: [15:8]; default: 7;
 *  ******* Description ***********
 */
#define PCR_FOSC_TICK_NUM    0x000000FFU
#define PCR_FOSC_TICK_NUM_M  (PCR_FOSC_TICK_NUM_V << PCR_FOSC_TICK_NUM_S)
#define PCR_FOSC_TICK_NUM_V  0x000000FFU
#define PCR_FOSC_TICK_NUM_S  8
/** PCR_TICK_ENABLE : R/W; bitpos: [16]; default: 1;
 *  ******* Description ***********
 */
#define PCR_TICK_ENABLE    (BIT(16))
#define PCR_TICK_ENABLE_M  (PCR_TICK_ENABLE_V << PCR_TICK_ENABLE_S)
#define PCR_TICK_ENABLE_V  0x00000001U
#define PCR_TICK_ENABLE_S  16
/** PCR_RST_TICK_CNT : R/W; bitpos: [17]; default: 0;
 *  ******* Description ***********
 */
#define PCR_RST_TICK_CNT    (BIT(17))
#define PCR_RST_TICK_CNT_M  (PCR_RST_TICK_CNT_V << PCR_RST_TICK_CNT_S)
#define PCR_RST_TICK_CNT_V  0x00000001U
#define PCR_RST_TICK_CNT_S  17

/** PCR_CTRL_32K_CONF_REG register
 *  32KHz clock configuration register
 */
#define PCR_CTRL_32K_CONF_REG (DR_REG_PCR_BASE + 0x134)
/** PCR_32K_SEL : R/W; bitpos: [1:0]; default: 0;
 *  This field indicates which one 32KHz clock will be used by MODEM_SYSTEM and
 *  timergroup. 0: OSC32K(default), 1: XTAL32K, 2/3: 32KHz from pad GPIO0.
 */
#define PCR_32K_SEL    0x00000003U
#define PCR_32K_SEL_M  (PCR_32K_SEL_V << PCR_32K_SEL_S)
#define PCR_32K_SEL_V  0x00000003U
#define PCR_32K_SEL_S  0

